FI/01_Test_Scripts/DriverScript/Res4/StRes1/Report/Data/Step15.js

function _get_dyn_external_content_for_st(){return '<div><style>.basic-block table td.no-border{padding-left:0;}</style><div class="st-act-wrapper "><div class="block basic-block"><table><tr><td class="name col-head-style">Name</td><td class="name col-head-style">Step ID</td><td class="name col-head-style">Status</td><td class="name col-head-style">Message</td></tr><tr><td class="value col-head-style">CreateFlightOrder</td><td class="value col-head-style">StServiceCallActivity9</td><td class="value col-head-style">Done</td><td class="value col-head-style">Web service call performed successfully</td></tr></table></div><div class="block other-props-block"><div class="block-title">More</div><table><tr><td class="name row-head-style">InputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity9_InputXml_c55b1f79-0f71-4ca3-a038-59ccd4fd115a.xml\', \'Data/StServiceCallActivity9_InputXml_c55b1f79-0f71-4ca3-a038-59ccd4fd115a.js4hrpt\', \'.xml\', \'InputXml\');return false;">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n  &lt;Body&gt;\r\n    &lt;CreateFlightOrder xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;FlightOrder&gt;\r\n        &lt;Class&gt;Economy&lt;/Class&gt;\r\n        &lt;CustomerName&gt;Christopher&lt;/CustomerName&gt;\r\n        &lt;DepartureDate&gt;2020-06-29T00:00:00&lt;/DepartureDate&gt;\r\n        &lt;FlightNumber&gt;180392&lt;/FlightNumber&gt;\r\n        &lt;NumberOfTickets&gt;2&lt;/NumberOfTickets&gt;\r\n      &lt;/FlightOrder&gt;\r\n    &lt;/CreateFlightOrder&gt;\r\n  &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Service</td><td class="value row-head-style">Flights_Service</td></tr><tr><td class="name row-head-style">Port</td><td class="value row-head-style">FlightsServiceMethods</td></tr><tr><td class="name row-head-style">Operation</td><td class="value row-head-style">CreateFlightOrder</td></tr><tr><td class="name row-head-style">Address</td><td class="value row-head-style">http://localhost:8000/Flights_SOAP</td></tr><tr><td class="name row-head-style">SOAPAction</td><td class="value row-head-style">HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder</td></tr><tr><td class="name row-head-style">ContentType</td><td class="value row-head-style">text/xml; charset=utf-8</td></tr><tr><td class="name row-head-style">MessageExchangePattern</td><td class="value row-head-style">Request Response</td></tr><tr><td class="name row-head-style">Full request</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity9_Full_request_67521111-2f2d-4642-afb5-26fd50175576.xml\', \'Data/StServiceCallActivity9_Full_request_67521111-2f2d-4642-afb5-26fd50175576.js4hrpt\', \'.xml\', \'Full request\');return false;">&lt;Envelope xmlns="htt ... &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">InputHeader</td><td class="value row-head-style">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder\nContent-Type:	text/xml; charset=utf-8\nHost:	localhost:8000\nContent-Length:	500\nExpect:	100-continue\nConnection:	Close\n</td></tr><tr><td class="name row-head-style">OutputHeader</td><td class="value row-head-style">Connection:	close\nContent-Length:	217\nContent-Type:	text/xml; charset=utf-8\nDate:	Tue, 09 Jun 2020 09:09:14 GMT\nServer:	Microsoft-HTTPAPI/2.0\n</td></tr><tr><td class="name row-head-style">OutputText</td><td class="value row-head-style">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;s:Fault&gt;&lt;faultcode&gt;s:Client&lt;/faultcode&gt;&lt;faultstring xml:lang="en-US"&gt;Flight number does not exist.&lt;/faultstring&gt;&lt;/s:Fault&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</td></tr><tr><td class="name row-head-style">HttpStatusCode</td><td class="value row-head-style">500 : InternalServerError</td></tr><tr><td class="name row-head-style">OutputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity9_OutputXml_961dbfde-a3e3-4330-b19f-01692f4196a1.xml\', \'Data/StServiceCallActivity9_OutputXml_961dbfde-a3e3-4330-b19f-01692f4196a1.js4hrpt\', \'.xml\', \'OutputXml\');return false;">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;s:Body&gt;\r\n    &lt;s:Fault&gt;\r\n      &lt;faultcode&gt;s:Client&lt;/faultcode&gt;\r\n      &lt;faultstring xml:lang="en-US"&gt;Flight number does not exist.&lt;/faultstring&gt;\r\n    &lt;/s:Fault&gt;\r\n  &lt;/s:Body&gt;\r\n&lt;/s:Envelope&gt;</a></td></tr> </table></div></div>';}